In [1]:
import pandas as pd
import numpy as np

In [13]:
people = {
    "first": ["Mykas", "Jane", "Tim", np.nan, None, "NA"],
    "last": ["RUtkauskas", "Anders", "Johnson", np.nan, "Motiejus", "Missing"],
    "email": ["myk.rut@milo.lt", "janders@yahoo.com", "timjogn@gmail.com", np.nan, None, "NA"],
    "age": ["33","45","62", None, None, "Missing"]
}

In [27]:
df=pd.DataFrame(people)
df.replace("NA", np.nan, inplace = True)
df.replace("Missing", np.nan, inplace = True)

In [28]:
df

   first        last              email   age
0  Mykas  RUtkauskas    myk.rut@milo.lt    33
1   Jane      Anders  janders@yahoo.com    45
2    Tim     Johnson  timjogn@gmail.com    62
3    NaN         NaN                NaN  None
4   None    Motiejus               None  None
5    NaN         NaN                NaN   NaN

In [29]:
df.dropna(axis="index", how= "any")

   first        last              email age
0  Mykas  RUtkauskas    myk.rut@milo.lt  33
1   Jane      Anders  janders@yahoo.com  45
2    Tim     Johnson  timjogn@gmail.com  62

In [30]:
df.dropna(axis="index", how= "all")

   first        last              email   age
0  Mykas  RUtkauskas    myk.rut@milo.lt    33
1   Jane      Anders  janders@yahoo.com    45
2    Tim     Johnson  timjogn@gmail.com    62
4   None    Motiejus               None  None

In [31]:
df.dropna(axis="columns", how= "all")

   first        last              email   age
0  Mykas  RUtkauskas    myk.rut@milo.lt    33
1   Jane      Anders  janders@yahoo.com    45
2    Tim     Johnson  timjogn@gmail.com    62
3    NaN         NaN                NaN  None
4   None    Motiejus               None  None
5    NaN         NaN                NaN   NaN

In [32]:
df.dropna(axis="columns", how= "any")

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [33]:
df.dropna(axis="index", how= "all", subset=["email", "last"])

   first        last              email   age
0  Mykas  RUtkauskas    myk.rut@milo.lt    33
1   Jane      Anders  janders@yahoo.com    45
2    Tim     Johnson  timjogn@gmail.com    62
4   None    Motiejus               None  None

In [34]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3   True   True   True   True
4   True  False   True   True
5   True   True   True   True

In [35]:
df.fillna("MISSING")

     first        last              email      age
0    Mykas  RUtkauskas    myk.rut@milo.lt       33
1     Jane      Anders  janders@yahoo.com       45
2      Tim     Johnson  timjogn@gmail.com       62
3  MISSING     MISSING            MISSING  MISSING
4  MISSING    Motiejus            MISSING  MISSING
5  MISSING     MISSING            MISSING  MISSING

In [36]:
df.fillna(0)

   first        last              email age
0  Mykas  RUtkauskas    myk.rut@milo.lt  33
1   Jane      Anders  janders@yahoo.com  45
2    Tim     Johnson  timjogn@gmail.com  62
3      0           0                  0   0
4      0    Motiejus                  0   0
5      0           0                  0   0

In [37]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [38]:
type(np.nan)

float

In [39]:
df["age"]= df["age"].astype(float)

In [40]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [41]:
df["age"].mean()

46.666666666666664